Revit 2027 API
ScheduleFieldId.Equals Method
 Determines whether the specified Object is equal to the current Object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override bool Equals(
	Object obj
)
Public Overrides Function Equals (
	obj As Object
) As Boolean
public:
virtual bool Equals(
	Object^ obj
) override
abstract Equals :
        obj : Object -> bool
override Equals :
        obj : Object -> bool
Parameters
obj Object
 The other object to evaluate.
Return Value
Boolean
See Also
Reference
ScheduleFieldId Class
Autodesk.Revit.DB Namespace